Documents/бит_ЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗаявлениеТСЖ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЧленыТСЖ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацииЗаявлениеТСЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЧленовТСЖ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолосов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ИнформацияТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ИнформацияТСЖ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Председатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацииЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииЗаявлениеТСЖ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВступлениеВТСЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходИзТСЖ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЗаявлениеТСЖ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НайденыДубли = Ложь;
	
	бит_ОбщегоНазначения.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "СписокЧленовТСЖ", 
	Новый Структура("ЛицевойСчет, Проживающий"), НайденыДубли);
	
	Если НайденыДубли Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	ДатаСоздания = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТСЖ"        , ТСЖ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(бит_ИнформацияТСЖСрезПоследних.ДатаСоздания) КАК ДатаСоздания,
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ТСЖ = &ТСЖ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСоздания = Выборка.ДатаСоздания;
	КонецЕсли; 
	
	ДатаУказанаНеВерно = Ложь;
	
	ТекстСообщения = "";
	
	НомераСтрок = "";
	
	Если ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ Тогда
		
		Для каждого СтрокаТаблицы Из СписокЧленовТСЖ Цикл
			
			Если СтрокаТаблицы.ДатаВступления < ДатаСоздания Тогда
				
				ДатаУказанаНеВерно = Истина;
				
				НомераСтрок = НомераСтрок + ", " + Формат(СтрокаТаблицы.НомерСтроки, "ЧГ=");
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ДатаУказанаНеВерно Тогда
		
		НомераСтрок = Сред(НомераСтрок, 3);
		
		ШаблонСообщенияОбОшибке = НСтр("ru = 'В строках %1 дата вступления раньше даты создания ТСЖ : %2.'");
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщенияОбОшибке, НомераСтрок, Формат(ДатаСоздания, "ДФ=dd.MM.yyyy"));
		
		ТекстСообщения = НСтр("ru = 'Значение даты вступления не должно быть меньше даты создания ТСЖ.'")
		+ ТекстСообщения;
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТекстСообщения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
		"Список членов ТСЖ", ТекстСообщения);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Список членов ТСЖ");
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_ЗаявлениеТСЖ.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Документы.бит_ЗаявлениеТСЖ.СформироватьДвижения_ЧленыТСЖ(
	ПараметрыПроведения, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
